help/help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>记录笔记</title>
<!-- 2017-04-20 Thu 16:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">记录笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. git</a>
<ul>
<li><a href="#sec-1-1">1.1. 找出修改的c文件和头文件</a></li>
<li><a href="#sec-1-2">1.2. git机器间克隆</a></li>
<li><a href="#sec-1-3">1.3. diff</a></li>
<li><a href="#sec-1-4">1.4. 根据commit，拉出分支</a></li>
<li><a href="#sec-1-5">1.5. 版本回退</a></li>
<li><a href="#sec-1-6">1.6. commit回退</a></li>
</ul>
</li>
<li><a href="#sec-2">2. grub</a>
<ul>
<li><a href="#sec-2-1">2.1. grub 恢复</a></li>
</ul>
</li>
<li><a href="#sec-3">3. iptables</a>
<ul>
<li><a href="#sec-3-1">3.1. nat</a></li>
</ul>
</li>
<li><a href="#sec-4">4. diff</a>
<ul>
<li><a href="#sec-4-1">4.1. 更新</a></li>
</ul>
</li>
<li><a href="#sec-5">5. find</a></li>
<li><a href="#sec-6">6. portal</a>
<ul>
<li><a href="#sec-6-1">6.1. portal新方法</a></li>
<li><a href="#sec-6-2">6.2. 公司对接过的portal服务器厂家</a></li>
</ul>
</li>
<li><a href="#sec-7">7. eloop</a></li>
<li><a href="#sec-8">8. vi</a>
<ul>
<li><a href="#sec-8-1">8.1. 查找</a></li>
<li><a href="#sec-8-2">8.2. 替换</a></li>
<li><a href="#sec-8-3">8.3. 显示换行</a></li>
<li><a href="#sec-8-4">8.4. 重复操作</a></li>
<li><a href="#sec-8-5">8.5. 匹配删除整行</a></li>
<li><a href="#sec-8-6">8.6. 改变文件编码</a></li>
</ul>
</li>
<li><a href="#sec-9">9. hrd</a></li>
<li><a href="#sec-10">10. dhcp</a>
<ul>
<li><a href="#sec-10-1">10.1. dhcp不能编译,原因是文件里面携带了 \r</a></li>
<li><a href="#sec-10-2">10.2. dhcp</a></li>
</ul>
</li>
<li><a href="#sec-11">11. vpn</a>
<ul>
<li><a href="#sec-11-1">11.1. pptp vpn 分流</a></li>
<li><a href="#sec-11-2">11.2. shadowsocks</a></li>
</ul>
</li>
<li><a href="#sec-12">12. yum</a></li>
<li><a href="#sec-13">13. color</a></li>
<li><a href="#sec-14">14. awk</a></li>
<li><a href="#sec-15">15. tail</a></li>
<li><a href="#sec-16">16. emacs</a>
<ul>
<li><a href="#sec-16-1">16.1. 修改字体大小，M-x,customize,Faces,Basic Faces,Default,Height-&gt;修改pt值</a></li>
<li><a href="#sec-16-2">16.2. 获取变量：</a></li>
<li><a href="#sec-16-3">16.3. align org table</a></li>
<li><a href="#sec-16-4">16.4. remove package</a></li>
<li><a href="#sec-16-5">16.5. 二进制编辑</a></li>
<li><a href="#sec-16-6">16.6. *.gz文件需要使用zgrep</a></li>
<li><a href="#sec-16-7">16.7. goto local definition</a></li>
<li><a href="#sec-16-8">16.8. find tab</a></li>
</ul>
</li>
<li><a href="#sec-17">17. ssh</a>
<ul>
<li><a href="#sec-17-1">17.1. ssh访问内网</a></li>
<li><a href="#sec-17-2">17.2. ssh快速登陆</a></li>
<li><a href="#sec-17-3">17.3. ssh升级</a></li>
</ul>
</li>
<li><a href="#sec-18">18. qstartdic</a></li>
<li><a href="#sec-19">19. align</a></li>
<li><a href="#sec-20">20. c complie</a></li>
<li><a href="#sec-21">21. compile different version</a></li>
<li><a href="#sec-22">22. ruby</a></li>
<li><a href="#sec-23">23. asciidoctor</a></li>
<li><a href="#sec-24">24. xargs</a></li>
<li><a href="#sec-25">25. vimgrep</a></li>
<li><a href="#sec-26">26. dhcp</a></li>
<li><a href="#sec-27">27. grub</a></li>
<li><a href="#sec-28">28. svn</a></li>
<li><a href="#sec-29">29. synergy</a></li>
<li><a href="#sec-30">30. regular</a></li>
<li><a href="#sec-31">31. locale</a></li>
<li><a href="#sec-32">32. endofline</a></li>
<li><a href="#sec-33">33. list.h</a></li>
<li><a href="#sec-34">34. hostname</a></li>
<li><a href="#sec-35">35. greenvpn</a></li>
<li><a href="#sec-36">36. date</a></li>
<li><a href="#sec-37">37. tftp</a></li>
<li><a href="#sec-38">38. make</a></li>
<li><a href="#sec-39">39. ifconfig</a></li>
<li><a href="#sec-40">40. sed</a></li>
<li><a href="#sec-41">41. grep</a></li>
<li><a href="#sec-42">42. shell</a></li>
<li><a href="#sec-43">43. ipcalc</a></li>
<li><a href="#sec-44">44. tcpdump</a></li>
<li><a href="#sec-45">45. nc</a></li>
<li><a href="#sec-46">46. gateway</a>
<ul>
<li><a href="#sec-46-1">46.1. X86</a></li>
<li><a href="#sec-46-2">46.2. 1200</a></li>
</ul>
</li>
<li><a href="#sec-47">47. synergy</a></li>
<li><a href="#sec-48">48. openwrt</a>
<ul>
<li><a href="#sec-48-1">48.1. coredump enable</a></li>
</ul>
</li>
<li><a href="#sec-49">49. aws</a></li>
<li><a href="#sec-50">50. zsh</a></li>
<li><a href="#sec-51">51. localtime</a></li>
<li><a href="#sec-52">52. perl</a></li>
<li><a href="#sec-53">53. hlist</a></li>
<li><a href="#sec-54">54. macos clear dns</a></li>
<li><a href="#sec-55">55. AC</a></li>
<li><a href="#sec-56">56. mail</a></li>
<li><a href="#sec-57">57. scanf</a></li>
<li><a href="#sec-58">58. ubuntu</a>
<ul>
<li><a href="#sec-58-1">58.1. install ag</a></li>
</ul>
</li>
<li><a href="#sec-59">59. linux</a></li>
<li><a href="#sec-60">60. stock</a>
<ul>
<li><a href="#sec-60-1">60.1. 股票历史数据</a></li>
</ul>
</li>
<li><a href="#sec-61">61. 绿联网卡转换</a></li>
<li><a href="#sec-62">62. nginx</a>
<ul>
<li><a href="#sec-62-1">62.1. enable directory listing</a></li>
</ul>
</li>
<li><a href="#sec-63">63. docker</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> git</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 找出修改的c文件和头文件</h3>
<div class="outline-text-3" id="text-1-1">
<p>
git status |grep modified |grep -E '.c\(|.h\)'|awk '{print $3}' |xargs<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> git机器间克隆</h3>
<div class="outline-text-3" id="text-1-2">
<p>
git clone root@10.50.123.52:/home/hello<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> diff</h3>
<div class="outline-text-3" id="text-1-3">
<p>
svn status|grep "\.c$"|awk '{print $2}'|xargs svn diff<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 根据commit，拉出分支</h3>
<div class="outline-text-3" id="text-1-4">
<p>
git checkout -b 2.5.xx-3062 fde1925ac4297ca3c6ac70bdabc6f55ccb470728<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 版本回退</h3>
<div class="outline-text-3" id="text-1-5">
<p>
git reset &#x2013;hard [commit_id]<br  />
git push &#x2013;force<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> commit回退</h3>
<div class="outline-text-3" id="text-1-6">
<p>
git revert [commit_id]<br  />
git push<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> grub</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> grub 恢复</h3>
<div class="outline-text-3" id="text-2-1">
<p>
grub&gt; root (hd0,0)<br  />
grub&gt; find /boot/grub/stage1<br  />
grub&gt; setup (hd0)<br  />
grub&gt; setup (hd0,0)<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> iptables</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> nat</h3>
<div class="outline-text-3" id="text-3-1">
<p>
iptables -t nat -A POSTROUTING -p tcp -s 192.2.1.0/24 -j SNAT &#x2013;to-source 10.60.0.235:1024-65535<br  />
iptables -t nat -A PREROUTING -p tcp -s 10.60.0.182/255.255.255.255 &#x2013;dport 443 -j REDIRECT &#x2013;to-ports 5000<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> diff</h2>
<div class="outline-text-2" id="text-4">
<p>
diff -ENwbur build/ wlc1/<br  />
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 更新</h3>
<div class="outline-text-3" id="text-4-1">
<p>
diff -Naur old_file new_file &gt; patch.1.0<br  />
patch -p0 &lt; patch.1.0<br  />
#old_file will update<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> find</h2>
<div class="outline-text-2" id="text-5">
<p>
find . -type f -exec touch {} \;<br  />
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> portal</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> portal新方法</h3>
<div class="outline-text-3" id="text-6-1">
<p>
1.目的地服务器放行， iptables -t nat -I PREROUTING -d 10.50.123.222 -j ACCEPT<br  />
2.用户地址段重定向至9000，iptables -t nat -A PREROUTING -p tcp -s 172.168.0.0/255.255.0.0 &#x2013;dport 80 -j REDIRECT &#x2013;to-ports 9000<br  />
3.认证完用户ip放行（利用ip set提高效率），规则插入在 2 之前<br  />
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 公司对接过的portal服务器厂家</h3>
<div class="outline-text-3" id="text-6-2">
<p>
泰联、蓝海、宁盾、热点科技、安朗、华为、亚信<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> eloop</h2>
<div class="outline-text-2" id="text-7">
<p>
eloop_run有段小技巧：利用select完成timeout<br  />
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> vi</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 查找</h3>
<div class="outline-text-3" id="text-8-1">
<p>
you might first place the cursor on the word "foo" then press * to search for that word.<br  />
</p>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 替换</h3>
<div class="outline-text-3" id="text-8-2">
<p>
:%s/vivian/sky/g vi替换所有<br  />
:%s/AD_DBG_LVL_\u\+, //g 去掉AD_DBG_LVL_DEBUG,AD_DBG_LVL_INFO之类<br  />
:%s/AUDIT_DATA_LOG/LOG_AL/g<br  />
:s/\t//g 去掉tab<br  />
:%s/foo/bar/gc <i>/Change each 'foo' to 'bar', but ask for confirmation first.<br  />
:%s</i>\&lt;foo\&gt;/bar/gc //Change only whole words exactly matching 'foo' to 'bar'; ask for confirmation.<br  />
:%s/foo/bar/gci Change each 'foo' (case insensitive due to the i flag) to 'bar'; ask for confirmation.<br  />
:%s/foo/bar/gcI Change each 'foo' (case sensitive due to the I flag) to 'bar'; ask for confirmation.<br  />
:'&lt;,'&gt;s/foo/bar/g<br  />
When compiled with +visual, change each 'foo' to 'bar' for all lines within a visual selection. Vim automatically appends the visual selection range ('&lt;,'&gt;) for any ex command when you select an area and enter :. Also, see Note below.<br  />
:.,+2s/foo/bar/g     Change each 'foo' to 'bar' for the current line (.) and the two next lines (+2).<br  />
:g/^baz/s/foo/bar/g<br  />
    Change each 'foo' to 'bar' in each line starting with 'baz'.<br  />
\{#\} is used for repetition. <i>foo.\{2\} will match foo and the two following characters. The \ is not required on the closing } so /foo.\{2} will do the same thing.<br  />
:s/Copyright \zs2007\ze All Rights Reserved/2008</i>  2007-&gt;2008 \zs \ze<br  />
    start and end<br  />
:%s//bar/g<br  />
    you need press "*" to search first<br  />
:%s/\&lt;foo\&gt;.*//<br  />
    On each line, delete the whole word "foo" and all following text (to end of line).<br  />
:s/^\\\(\w\)/\u\1/<br  />
    If the first character at the beginning of the current line only is lowercase, switch it to uppercase using \u<br  />
</p>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 显示换行</h3>
<div class="outline-text-3" id="text-8-3">
<p>
如果你使用以下命令进入&lt;list mode&gt;，那么就可以清楚的看到以“$”表示的换行符和以“^I”表示的制表符。<br  />
:set list<br  />
</p>
</div>
</div>
