help/help.org
** 重复操作
" Recording (BEST TIP of ALL)
qq  # record to q
your complex series of commands
q   # end recording
@q to execute
@@ to Repeat
5@@ to Repeat 5 times
qQ@qq                             : Make an existing recording q recursive *N*
" editing a register/recording
"qp                               :display contents of register q (normal mode)
<ctrl-R>q                         :display contents of register q (insert mode)
" you can now see recording contents, edit as required
"qdd                              :put changed contacts back into q
@q                                :execute recording/register q
** 匹配删除整行
删除非不含GET和POST的行
:g!/\(GET\|POST)/d
** 改变文件编码
set fileencoding=utf8
* hrd
cd /usr/local/ac/config/; sed -i  '/notify_mac/d'  hr.conf ; sed -i '2i\notify_mac = 0' hr.conf
* dhcp
** dhcp不能编译,原因是文件里面携带了 \r
find . -type f |xargs file |grep CR|awk -F : '{print $1}'|xargs sed -i 's!\r!!'

** dhcp
sed -i 's/range \([^#]*\);/pool {\n    range \1;\n}/g' dhcpd.conf
sed -i ':a;N;$!ba;s/\(subnet.*\)\n}/\1 \ncase 1:fsf\n}/g' dhcpd.conf
http://stackoverflow.com/questions/1251999/how-can-i-replace-a-newline-n-using-sed/7697604#7697604

sed -i ':a;N;$!ba;s/ \(option routers 10.60.123.222;\n\)\s*\(break;\)/ #\1    #\2/g' dhcpd.conf
* vpn
fail:
pptpsetup --create vpn --server 10.1.1.85 --username fangzheng --password www8gbcom9COM~CN! --encrypt --start
OK:
(pppd call vpn logfd 2 nodetach debug dump refuse-eap &)
route add default gw 192.168.168.106
** pptp vpn 分流
Mac OS X

在终端中执行python chnroutes.py -p mac，这将生成ip-up和ip-down两个文件；
将这两个文件移入/etc/ppp/；
重新连接VPN，观察测试。
** shadowsocks
服务器配置：
cat /etc/shadowsocks.json
{
    "server":"0.0.0.0",
    "server_port":6666,
    "local_address": "127.0.0.1",
    "local_port":1000,
    "password":"12345678",
    "timeout":300,
    "method":"aes-256-cfb",
    "fast_open": false
}

sudo ssserver -c /etc/shadowsocks.json -d start
sudo ssserver -c /etc/shadowsocks.json -d stop

客户端：
ssclient: 如何设置代理配置文件
http://xmodulo.com/how-to-set-up-proxy-auto-config-on-ubuntu-desktop.html

* yum
yum groupinstall -y   "Desktop"   "Desktop Platform"   "Desktop Platform Development"　 "Fonts" 　"General Purpose Desktop"　 "Graphical Administration Tools"　 "Graphics Creation Tools" 　"Input Methods" 　"X Window System" 　"Chinese Support [zh]"　"Internet Browser"

* color
  \e[0;32m $PWD \e[0m
* awk
tail -n 1 /samba/sh000001.org|awk '{ i=1;while(i<NF) {if((i%4)==1) {print $i,$(i+1),$(i+2),$(i+3)} i=i+4}}'
tail -n 3 /samba/sh000001.org|head -n 1|awk '{ i=1;while(i<NF) {if((i%4)==1) {print $i,$(i+1),$(i+2),$(i+3)} i=i+4}}'

* tail
tail -n 3 /samba/sh000001.org |head -n 1| awk '{ i=1;while(i<NF) {if((i%4)==1) {print $i,$(i+1),$(i+2),$(i+3)} i=i+4}}'  打印倒数第二行
* emacs
**  修改字体大小，M-x,customize,Faces,Basic Faces,Default,Height->修改pt值
** 获取变量：
The elisp function you're running is describe-variable:
(describe-variable VARIABLE)

** align org table
emacs stock.org --batch -l ~/.emacs.d/init.el --eval '(progn(org-table-align))' -f save-buffer --kill

** remove package
The command package-menu-mark-delete (key 'd') followed by package-menu-execute (key 'x') worked for me.
** 二进制编辑
M-x hexl-mode
退出二进制 C-c C-c
** *.gz文件需要使用zgrep
** goto local definition
http://stackoverflow.com/questions/12289903/how-do-i-go-to-a-local-variables-definition-with-emacs-and-gnu-global
** find tab
C-s C-q <TAB>
C-s <TAB>
* ssh
** ssh访问内网
内网ssh设置
ssh -NfR 7777:localhost:22 root@180.168.191.198
公网ssh设置：
ssh -NfL 0.0.0.0:5555:localhost:7777 localhost
家里访问：
ssh root@180.168.191.198 -p 5555
更简单的方法(服务器sshd_config配置开启gatewayports)：
ssh -NfR 0.0.0.0:9990:localhost:22 root@180.168.191.198 -o GatewayPorts=yes -o ConnectTimeout=10  -o ConnectionAttempts=5 -o ServerAliveInterval=2

你家里的电脑只要这么访问：
ssh root@180.168.191.198 -p 9990

** ssh快速登陆

A -> B
追加复制 A 的公钥至 B 的authorized_keys
配置A的.ssh/config
Host 10.60.123.222
user fabius8

** ssh升级
新的ssh包 7.0 版本之后登录问题汇总：

1. root用户密码不能登录。
解决方法：sshd_config 增加 PermitRootLogin yes

2. sshd 7.0之后版本默认不开启 ssh-dss 证书加密
解决方法：证书使用其他加密方式

官方链接：
http://www.openssh.com/txt/release-7.0

* qstartdic
* align
:AlignCtrl l 左对齐
:AlignCtrl r 右对齐
:AlignCtrl lrlr 第一部分左对齐，第二部分右对其 ...
:AlignCtrl lp0P0 左对其, 左空一，右空一
对当前位置到第6行注释对其
#+begin_src vim
.,+6Align /\*
#+end_src

* c complie
question: #define to_find "^.*\.(dat)?"
The warning is coming from the C compiler. It is telling you that \. is not a known escape sequence in C. Since this string is going to a regex engine, you need to double-escape the slash, like this:
#define to_find "^.*\\.(dat)?"
