help/help.html

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 重复操作</h3>
<div class="outline-text-3" id="text-8-4">
<p>
" Recording (BEST TIP of ALL)<br  />
qq  # record to q<br  />
your complex series of commands<br  />
q   # end recording<br  />
@q to execute<br  />
@@ to Repeat<br  />
5@@ to Repeat 5 times<br  />
qQ@qq                             : Make an existing recording q recursive <b>N</b><br  />
" editing a register/recording<br  />
"qp                               :display contents of register q (normal mode)<br  />
&lt;ctrl-R&gt;q                         :display contents of register q (insert mode)<br  />
" you can now see recording contents, edit as required<br  />
"qdd                              :put changed contacts back into q<br  />
@q                                :execute recording/register q<br  />
</p>
</div>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 匹配删除整行</h3>
<div class="outline-text-3" id="text-8-5">
<p>
删除非不含GET和POST的行<br  />
:g!/\(GET\|POST)/d<br  />
</p>
</div>
</div>
<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> 改变文件编码</h3>
<div class="outline-text-3" id="text-8-6">
<p>
set fileencoding=utf8<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> hrd</h2>
<div class="outline-text-2" id="text-9">
<p>
cd <i>usr/local/ac/config</i>; sed -i  '/notify_mac/d'  hr.conf ; sed -i '2i\notify_mac = 0' hr.conf<br  />
</p>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> dhcp</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> dhcp不能编译,原因是文件里面携带了 \r</h3>
<div class="outline-text-3" id="text-10-1">
<p>
find . -type f |xargs file |grep CR|awk -F : '{print $1}'|xargs sed -i 's!\r!!'<br  />
</p>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> dhcp</h3>
<div class="outline-text-3" id="text-10-2">
<p>
sed -i 's/range \([^#]*\);/pool {\n    range \1;\n}/g' dhcpd.conf<br  />
sed -i ':a;N;$!ba;s/\(subnet.*\)\n}/\1 \ncase 1:fsf\n}/g' dhcpd.conf<br  />
<a href="http://stackoverflow.com/questions/1251999/how-can-i-replace-a-newline-n-using-sed/7697604#7697604">http://stackoverflow.com/questions/1251999/how-can-i-replace-a-newline-n-using-sed/7697604#7697604</a><br  />
</p>

<p>
sed -i ':a;N;$!ba;s/ \(option routers 10.60.123.222;\n\)\s*\(break;\)/ #\1    #\2/g' dhcpd.conf<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> vpn</h2>
<div class="outline-text-2" id="text-11">
<p>
fail:<br  />
pptpsetup &#x2013;create vpn &#x2013;server 10.1.1.85 &#x2013;username fangzheng &#x2013;password www8gbcom9COM~CN! &#x2013;encrypt &#x2013;start<br  />
OK:<br  />
(pppd call vpn logfd 2 nodetach debug dump refuse-eap &amp;)<br  />
route add default gw 192.168.168.106<br  />
</p>
</div>
<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> pptp vpn 分流</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Mac OS X<br  />
</p>

<p>
在终端中执行python chnroutes.py -p mac，这将生成ip-up和ip-down两个文件；<br  />
将这两个文件移入/etc/ppp/；<br  />
重新连接VPN，观察测试。<br  />
</p>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> shadowsocks</h3>
<div class="outline-text-3" id="text-11-2">
<p>
服务器配置：<br  />
cat /etc/shadowsocks.json<br  />
{<br  />
    "server":"0.0.0.0",<br  />
    "server_port":6666,<br  />
    "local_address": "127.0.0.1",<br  />
    "local_port":1000,<br  />
    "password":"12345678",<br  />
    "timeout":300,<br  />
    "method":"aes-256-cfb",<br  />
    "fast_open": false<br  />
}<br  />
</p>

<p>
sudo ssserver -c /etc/shadowsocks.json -d start<br  />
sudo ssserver -c /etc/shadowsocks.json -d stop<br  />
</p>

<p>
客户端：<br  />
ssclient: 如何设置代理配置文件<br  />
<a href="http://xmodulo.com/how-to-set-up-proxy-auto-config-on-ubuntu-desktop.html">http://xmodulo.com/how-to-set-up-proxy-auto-config-on-ubuntu-desktop.html</a><br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> yum</h2>
<div class="outline-text-2" id="text-12">
<p>
yum groupinstall -y   "Desktop"   "Desktop Platform"   "Desktop Platform Development"　 "Fonts" 　"General Purpose Desktop"　 "Graphical Administration Tools"　 "Graphics Creation Tools" 　"Input Methods" 　"X Window System" 　"Chinese Support [zh]"　"Internet Browser"<br  />
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> color</h2>
<div class="outline-text-2" id="text-13">
<p>
\e[0;32m $PWD \e[0m<br  />
</p>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> awk</h2>
<div class="outline-text-2" id="text-14">
<p>
tail -n 1 /samba/sh000001.org|awk '{ i=1;while(i&lt;NF) {if((i%4)==1) {print $i,$(i+1),$(i+2),$(i+3)} i=i+4}}'<br  />
tail -n 3 /samba/sh000001.org|head -n 1|awk '{ i=1;while(i&lt;NF) {if((i%4)==1) {print $i,$(i+1),$(i+2),$(i+3)} i=i+4}}'<br  />
</p>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> tail</h2>
<div class="outline-text-2" id="text-15">
<p>
tail -n 3 /samba/sh000001.org |head -n 1| awk '{ i=1;while(i&lt;NF) {if((i%4)==1) {print $i,$(i+1),$(i+2),$(i+3)} i=i+4}}'  打印倒数第二行<br  />
</p>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> emacs</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> 修改字体大小，M-x,customize,Faces,Basic Faces,Default,Height-&gt;修改pt值</h3>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> 获取变量：</h3>
<div class="outline-text-3" id="text-16-2">
<p>
The elisp function you're running is describe-variable:<br  />
(describe-variable VARIABLE)<br  />
</p>
</div>
</div>

<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> align org table</h3>
<div class="outline-text-3" id="text-16-3">
<p>
emacs stock.org &#x2013;batch -l ~/.emacs.d/init.el &#x2013;eval '(progn(org-table-align))' -f save-buffer &#x2013;kill<br  />
</p>
</div>
</div>

<div id="outline-container-sec-16-4" class="outline-3">
<h3 id="sec-16-4"><span class="section-number-3">16.4</span> remove package</h3>
<div class="outline-text-3" id="text-16-4">
<p>
The command package-menu-mark-delete (key 'd') followed by package-menu-execute (key 'x') worked for me.<br  />
</p>
</div>
</div>
<div id="outline-container-sec-16-5" class="outline-3">
<h3 id="sec-16-5"><span class="section-number-3">16.5</span> 二进制编辑</h3>
<div class="outline-text-3" id="text-16-5">
<p>
M-x hexl-mode<br  />
退出二进制 C-c C-c<br  />
</p>
</div>
</div>
<div id="outline-container-sec-16-6" class="outline-3">
<h3 id="sec-16-6"><span class="section-number-3">16.6</span> *.gz文件需要使用zgrep</h3>
</div>
<div id="outline-container-sec-16-7" class="outline-3">
<h3 id="sec-16-7"><span class="section-number-3">16.7</span> goto local definition</h3>
<div class="outline-text-3" id="text-16-7">
<p>
<a href="http://stackoverflow.com/questions/12289903/how-do-i-go-to-a-local-variables-definition-with-emacs-and-gnu-global">http://stackoverflow.com/questions/12289903/how-do-i-go-to-a-local-variables-definition-with-emacs-and-gnu-global</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-16-8" class="outline-3">
<h3 id="sec-16-8"><span class="section-number-3">16.8</span> find tab</h3>
<div class="outline-text-3" id="text-16-8">
<p>
C-s C-q &lt;TAB&gt;<br  />
C-s &lt;TAB&gt;<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> ssh</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> ssh访问内网</h3>
<div class="outline-text-3" id="text-17-1">
<p>
内网ssh设置<br  />
ssh -NfR 7777:localhost:22 root@180.168.191.198<br  />
公网ssh设置：<br  />
ssh -NfL 0.0.0.0:5555:localhost:7777 localhost<br  />
家里访问：<br  />
ssh root@180.168.191.198 -p 5555<br  />
更简单的方法(服务器sshd_config配置开启gatewayports)：<br  />
ssh -NfR 0.0.0.0:9990:localhost:22 root@180.168.191.198 -o GatewayPorts=yes -o ConnectTimeout=10  -o ConnectionAttempts=5 -o ServerAliveInterval=2<br  />
</p>

<p>
你家里的电脑只要这么访问：<br  />
ssh root@180.168.191.198 -p 9990<br  />
</p>
</div>
</div>

<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> ssh快速登陆</h3>
<div class="outline-text-3" id="text-17-2">
<p>
A -&gt; B<br  />
追加复制 A 的公钥至 B 的authorized_keys<br  />
配置A的.ssh/config<br  />
Host 10.60.123.222<br  />
user fabius8<br  />
</p>
</div>
</div>

<div id="outline-container-sec-17-3" class="outline-3">
<h3 id="sec-17-3"><span class="section-number-3">17.3</span> ssh升级</h3>
<div class="outline-text-3" id="text-17-3">
<p>
新的ssh包 7.0 版本之后登录问题汇总：<br  />
</p>

<ol class="org-ol">
<li>root用户密码不能登录。<br  />
</li>
</ol>
<p>
解决方法：sshd_config 增加 PermitRootLogin yes<br  />
</p>

<ol class="org-ol">
<li>sshd 7.0之后版本默认不开启 ssh-dss 证书加密<br  />
</li>
</ol>
<p>
解决方法：证书使用其他加密方式<br  />
</p>

<p>
官方链接：<br  />
<a href="http://www.openssh.com/txt/release-7.0">http://www.openssh.com/txt/release-7.0</a><br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> qstartdic</h2>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> align</h2>
<div class="outline-text-2" id="text-19">
<p>
:AlignCtrl l 左对齐<br  />
:AlignCtrl r 右对齐<br  />
:AlignCtrl lrlr 第一部分左对齐，第二部分右对其 &#x2026;<br  />
:AlignCtrl lp0P0 左对其, 左空一，右空一<br  />
对当前位置到第6行注释对其<br  />
</p>
<div class="org-src-container">

<pre class="src src-vim">.,+6Align /\*
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> c complie</h2>
<div class="outline-text-2" id="text-20">
<p>
question: #define to_find "^.*\.(dat)?"<br  />
The warning is coming from the C compiler. It is telling you that \. is not a known escape sequence in C. Since this string is going to a regex engine, you need to double-escape the slash, like this:<br  />
#define to_find "^.*\\.(dat)?"<br  />
</p>
</div>
</div>
