help/help.org
* compile different version
fabius8@centos6:~/wlansvn/ac-xa01-2.5.X.X $ svn status|grep Makefile                                                                                                       1 ↵
M       syslog/Makefile
M       pa/Makefile
M       Makefile
* ruby
Ruby Version Manager (RVM)
http://www.rvm.io/
* asciidoctor
asciidoctor sample.adoc
asciidoctor -r asciidoctor-diagram sample.adoc
asciidoctor-pdf -r asciidoctor-diagram -r asciidoctor-pdf-cjk-kai_gen_gothic -a pdf-style=KaiGenGothicCN sample.adoc
asciidoctor -r asciidoctor-diagram -a data-uri sample.adoc

* xargs
=find . |xargs file|grep broken |awk -F : '{print $1}' |xargs rm=
* vimgrep
=vimgrep /pattern/ %=           在当前打开文件中查找
=vimgrep /pattern/ *=             在当前目录下查找所有
=vimgrep /pattern/ **=            在当前目录及子目录下查找所有
=vimgrep /pattern/ *.c=          查找当前目录下所有.c文件
=vimgrep /pattern/ **/*=         只查找子目录
* dhcp
vi /etc/sysconfig/network-scripts/ifcfg-eth0
BOOTPROTO=dhcp
service network restart

* grub
MOD1:
1. mkfs.vfat /dev/sdb -I
2. /usr/local/sbin/grub-install --boot-directory=/mnt/upan/boot /dev/sdb --force   
MOD2:
1. mkfs.vfat /dev/sdb -I
2. losetup /dev/loop0 /dev/sdb
3. mount /dev/loop0 /mnt/upan
4. /usr/local/sbin/grub-install --boot-directory=/mnt/upan/bugbios --force --allow-floppy /dev/loop0   
5.  /usr/local/sbin/grub2-mkconfig -o /mnt/upan/boot/grub/grub.cfg 

iso 文件挂载
mount -t iso9660 -o loop xxx.iso /some/path
* svn
撤销修改
svn revert -R .
* synergy
http://synergy-project.org/download/free/
* regular
取反 [^内容]
* locale
改变语言
vi =/etc/default/locale=

ubuntu:
dpkg-reconfigure locales
设置静态地址
http://www.sudo-juice.com/how-to-set-a-static-ip-in-ubuntu-the-proper-way/

sudo update-alternatives --config editor 
* endofline
set binary
set noendofline
* list.h
使用方法: http://isis.poly.edu/kulesh/stuff/src/klist/
* hostname
http://www.electrictoolbox.com/changing-hostname-centos/
* greenvpn
我的推广账户
http://gjsq.me/11435742
长期有效
http://greenvpn.site 

* date
date -d "2015-01-01" +%A
查看星期几
* tftp
AP:tftp 
AC:tftpd 
查看会看到udp:69端口

http://www.davidsudjiman.info/2006/03/27/installing-and-setting-tftpd-in-ubuntu/
* make
  静态编译
-Wl,-dn -Wl,-dy  

查看动态库
ldconfig -p 
* ifconfig
获取mac地址
目录可能不一样：
#+BEGIN_SRC bash
cat /sys/devices/virtual/net/lo/subsystem/eth0/address
#+END_SRC
目录可能不一样：
#+BEGIN_SRC bash
cd /sys/;find . |grep address|grep eth0/address| xargs cat
#+END_SRC
* sed
打印输出前6个字符
#+begin_src bash
echo aa_bb_cc_ff-13123123123213 |sed "s/\(^.\{6\}\)\(.*\)/\1/"
#+end_src
* grep
打印输出前6个字符
#+begin_src bash
echo aa_bb_cc_ff-13123123123213 |grep -E "^.{6}" -o
#+end_src
* shell
  shell传命令参数
http://stackoverflow.com/questions/192249/how-do-i-parse-command-line-arguments-in-bash/14203146#14203146

* ipcalc
# ipcalc -4 -b 202.97.232.0/25
BROADCAST=202.97.232.127
# 广播地址

# ipcalc -4 -p 202.97.232.0/25
PREFIX=25

# ipcalc -4 -n 202.97.232.7/25
NETWORK=202.97.232.0

# ipcalc -4 -m 202.97.232.7/25
NETMASK=255.255.255.128

## shell下string to number
teddy@toshiba~$ a="76"
teddy@toshiba~$ echo $((a+3))
79
teddy@toshiba~$ echo $((a-12))
64
* tcpdump
1. 注意第二片分片报文使用没有udp和tcp

* nc
nc 传单个文件，只要有一方能ping通就能传文件
=================================
server接收端:
$ nc -l -p 8880 > a.html

client发送端：
$ nc 10.10.10.10 8880 < a.html

server发送端：
$ cat a.html | nc -l 8880

client接受端：
$ nc 10.10.10.10 88880 > a.html

* gateway
  make P=app/common; make P=app/cgi clean; make P=app/cgi
** X86
  killall snmpManager.cgi;/appfs/bin/spawn-fcgi -a 127.0.0.1 -p 9000 -f /appfs/web/snmpManager.cgi

** 1200
  
* synergy
MAC版本:
http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-MacOSX1011-x86_64.dmg

Windows版本：
http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Windows-x86.msi
http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Windows-x64.msi

Centos版本：
http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-i686.rpm
http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-x86_64.rpm

Ubuntu版本：
http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-i686.deb
http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-x86_64.deb
