help/help.html
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> compile different version</h2>
<div class="outline-text-2" id="text-21">
<p>
fabius8@centos6:~/wlansvn/ac-xa01-2.5.X.X $ svn status|grep Makefile                                                                                                       1 ↵<br  />
M       syslog/Makefile<br  />
M       pa/Makefile<br  />
M       Makefile<br  />
</p>
</div>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> ruby</h2>
<div class="outline-text-2" id="text-22">
<p>
Ruby Version Manager (RVM)<br  />
<a href="http://www.rvm.io/">http://www.rvm.io/</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> asciidoctor</h2>
<div class="outline-text-2" id="text-23">
<p>
asciidoctor sample.adoc<br  />
asciidoctor -r asciidoctor-diagram sample.adoc<br  />
asciidoctor-pdf -r asciidoctor-diagram -r asciidoctor-pdf-cjk-kai_gen_gothic -a pdf-style=KaiGenGothicCN sample.adoc<br  />
asciidoctor -r asciidoctor-diagram -a data-uri sample.adoc<br  />
</p>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> xargs</h2>
<div class="outline-text-2" id="text-24">
<p>
<code>find . |xargs file|grep broken |awk -F : '{print $1}' |xargs rm</code><br  />
</p>
</div>
</div>
<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> vimgrep</h2>
<div class="outline-text-2" id="text-25">
<p>
<code>vimgrep /pattern/ %</code>           在当前打开文件中查找<br  />
<code>vimgrep /pattern/ *</code>             在当前目录下查找所有<br  />
<code>vimgrep /pattern/ **</code>            在当前目录及子目录下查找所有<br  />
<code>vimgrep /pattern/ *.c</code>          查找当前目录下所有.c文件<br  />
<code>vimgrep /pattern/ **/*</code>         只查找子目录<br  />
</p>
</div>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> dhcp</h2>
<div class="outline-text-2" id="text-26">
<p>
vi /etc/sysconfig/network-scripts/ifcfg-eth0<br  />
BOOTPROTO=dhcp<br  />
service network restart<br  />
</p>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> grub</h2>
<div class="outline-text-2" id="text-27">
<p>
MOD1:<br  />
</p>
<ol class="org-ol">
<li>mkfs.vfat /dev/sdb -I<br  />
</li>
<li>/usr/local/sbin/grub-install &#x2013;boot-directory=/mnt/upan/boot /dev/sdb &#x2013;force<br  />
</li>
</ol>
<p>
MOD2:<br  />
</p>
<ol class="org-ol">
<li>mkfs.vfat /dev/sdb -I<br  />
</li>
<li>losetup /dev/loop0 /dev/sdb<br  />
</li>
<li>mount /dev/loop0 /mnt/upan<br  />
</li>
<li>/usr/local/sbin/grub-install &#x2013;boot-directory=/mnt/upan/bugbios &#x2013;force &#x2013;allow-floppy /dev/loop0<br  />
</li>
<li>/usr/local/sbin/grub2-mkconfig -o /mnt/upan/boot/grub/grub.cfg<br  />
</li>
</ol>

<p>
iso 文件挂载<br  />
mount -t iso9660 -o loop xxx.iso /some/path<br  />
</p>
</div>
</div>
<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> svn</h2>
<div class="outline-text-2" id="text-28">
<p>
撤销修改<br  />
svn revert -R .<br  />
</p>
</div>
</div>
<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> synergy</h2>
<div class="outline-text-2" id="text-29">
<p>
<a href="http://synergy-project.org/download/free/">http://synergy-project.org/download/free/</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> regular</h2>
<div class="outline-text-2" id="text-30">
<p>
取反 [^内容]<br  />
</p>
</div>
</div>
<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> locale</h2>
<div class="outline-text-2" id="text-31">
<p>
改变语言<br  />
vi <code>/etc/default/locale</code><br  />
</p>

<p>
ubuntu:<br  />
dpkg-reconfigure locales<br  />
设置静态地址<br  />
<a href="http://www.sudo-juice.com/how-to-set-a-static-ip-in-ubuntu-the-proper-way/">http://www.sudo-juice.com/how-to-set-a-static-ip-in-ubuntu-the-proper-way/</a><br  />
</p>

<p>
sudo update-alternatives &#x2013;config editor<br  />
</p>
</div>
</div>
<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> endofline</h2>
<div class="outline-text-2" id="text-32">
<p>
set binary<br  />
set noendofline<br  />
</p>
</div>
</div>
<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> list.h</h2>
<div class="outline-text-2" id="text-33">
<p>
使用方法: <a href="http://isis.poly.edu/kulesh/stuff/src/klist/">http://isis.poly.edu/kulesh/stuff/src/klist/</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> hostname</h2>
<div class="outline-text-2" id="text-34">
<p>
<a href="http://www.electrictoolbox.com/changing-hostname-centos/">http://www.electrictoolbox.com/changing-hostname-centos/</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> greenvpn</h2>
<div class="outline-text-2" id="text-35">
<p>
我的推广账户<br  />
<a href="http://gjsq.me/11435742">http://gjsq.me/11435742</a><br  />
长期有效<br  />
<a href="http://greenvpn.site">http://greenvpn.site</a> <br  />
</p>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> date</h2>
<div class="outline-text-2" id="text-36">
<p>
date -d "2015-01-01" +%A<br  />
查看星期几<br  />
</p>
</div>
</div>
<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> tftp</h2>
<div class="outline-text-2" id="text-37">
<p>
AP:tftp<br  />
AC:tftpd<br  />
查看会看到udp:69端口<br  />
</p>

<p>
<a href="http://www.davidsudjiman.info/2006/03/27/installing-and-setting-tftpd-in-ubuntu/">http://www.davidsudjiman.info/2006/03/27/installing-and-setting-tftpd-in-ubuntu/</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> make</h2>
<div class="outline-text-2" id="text-38">
<p>
  静态编译<br  />
-Wl,-dn -Wl,-dy<br  />
</p>

<p>
查看动态库<br  />
ldconfig -p<br  />
</p>
</div>
</div>
<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> ifconfig</h2>
<div class="outline-text-2" id="text-39">
<p>
获取mac地址<br  />
目录可能不一样：<br  />
</p>
<div class="org-src-container">

<pre class="src src-bash">cat /sys/devices/virtual/net/lo/subsystem/eth0/address
</pre>
</div>
<p>
目录可能不一样：<br  />
</p>
<div class="org-src-container">

<pre class="src src-bash">cd /sys/;find . |grep address|grep eth0/address| xargs cat
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> sed</h2>
<div class="outline-text-2" id="text-40">
<p>
打印输出前6个字符<br  />
</p>
<div class="org-src-container">

<pre class="src src-bash">echo aa_bb_cc_ff-13123123123213 |sed "s/\(^.\{6\}\)\(.*\)/\1/"
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> grep</h2>
<div class="outline-text-2" id="text-41">
<p>
打印输出前6个字符<br  />
</p>
<div class="org-src-container">

<pre class="src src-bash">echo aa_bb_cc_ff-13123123123213 |grep -E "^.{6}" -o
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> shell</h2>
<div class="outline-text-2" id="text-42">
<p>
shell传命令参数<br  />
<a href="http://stackoverflow.com/questions/192249/how-do-i-parse-command-line-arguments-in-bash/14203146#14203146">http://stackoverflow.com/questions/192249/how-do-i-parse-command-line-arguments-in-bash/14203146#14203146</a><br  />
</p>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> ipcalc</h2>
<div class="outline-text-2" id="text-43">
<p>
BROADCAST=202.97.232.127<br  />
</p>
<p>
PREFIX=25<br  />
</p>

<p>
NETWORK=202.97.232.0<br  />
</p>

<p>
NETMASK=255.255.255.128<br  />
</p>

<p>
## shell下string to number<br  />
teddy@toshiba~$ a="76"<br  />
teddy@toshiba~$ echo \(((a+3))
79
teddy@toshiba~\) echo $((a-12))<br  />
64<br  />
</p>
</div>
</div>
<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> tcpdump</h2>
<div class="outline-text-2" id="text-44">
<ol class="org-ol">
<li>注意第二片分片报文使用没有udp和tcp<br  />
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> nc</h2>
<div class="outline-text-2" id="text-45">
<p>
nc 传单个文件，只要有一方能ping通就能传文件<br  />
<code>===============================</code><br  />
server接收端:<br  />
$ nc -l -p 8880 &gt; a.html<br  />
</p>

<p>
client发送端：<br  />
$ nc 10.10.10.10 8880 &lt; a.html<br  />
</p>

<p>
server发送端：<br  />
$ cat a.html | nc -l 8880<br  />
</p>

<p>
client接受端：<br  />
$ nc 10.10.10.10 88880 &gt; a.html<br  />
</p>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> gateway</h2>
<div class="outline-text-2" id="text-46">
<p>
make P=app/common; make P=app/cgi clean; make P=app/cgi<br  />
</p>
</div>
<div id="outline-container-sec-46-1" class="outline-3">
<h3 id="sec-46-1"><span class="section-number-3">46.1</span> X86</h3>
<div class="outline-text-3" id="text-46-1">
<p>
killall snmpManager.cgi;/appfs/bin/spawn-fcgi -a 127.0.0.1 -p 9000 -f /appfs/web/snmpManager.cgi<br  />
</p>
</div>
</div>

<div id="outline-container-sec-46-2" class="outline-3">
<h3 id="sec-46-2"><span class="section-number-3">46.2</span> 1200</h3>
</div>
</div>

<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> synergy</h2>
<div class="outline-text-2" id="text-47">
<p>
MAC版本:<br  />
<a href="http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-MacOSX1011-x86_64.dmg">http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-MacOSX1011-x86_64.dmg</a><br  />
</p>

<p>
Windows版本：<br  />
<a href="http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Windows-x86.msi">http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Windows-x86.msi</a><br  />
<a href="http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Windows-x64.msi">http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Windows-x64.msi</a><br  />
</p>

<p>
Centos版本：<br  />
<a href="http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-i686.rpm">http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-i686.rpm</a><br  />
<a href="http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-x86_64.rpm">http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-x86_64.rpm</a><br  />
</p>

<p>
Ubuntu版本：<br  />
<a href="http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-i686.deb">http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-i686.deb</a><br  />
<a href="http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-x86_64.deb">http://synergy-project.org/files/nightly/synergy-v1.8.1-stable-257ac01-Linux-x86_64.deb</a><br  />
</p>
</div>
</div>
