help/help.org
* openwrt
wireless router
** coredump enable
on your target you should extra do the following:
touch /.init_enable_core
sysctl -w "kernel.core_pattern=/tmp/%e.%p.%s.%t.core"

the first will enable core dumps on all applications started with busybox init (so the feature you enabled)

the second will tell the kernel where to store the core dumps (e.g. in /tmp/)
* aws
fabius8@126.com
fang3688
雅洁建行
* zsh
修改登录shell 
sudo chsh fabius8
git tab很慢:
http://stackoverflow.com/questions/9810327/git-tab-autocompletion-is-useless-can-i-turn-it-off-or-optimize-it

* localtime

[root@www ~]# date
Thu Jul 28 15:08:39 CST 2011  <==重點是 CST 這個時區喔！

[root@www ~]# vim /etc/sysconfig/clock
ZONE="America/New_York"       <==改的是這裡啦！

[root@www ~]# cp /usr/share/zoneinfo/America/New_York /etc/localtime
[root@www ~]# date
Thu Jul 28 03:09:21 EDT 2011  <==時區與時間都改變了！

* perl
  CC      kernel/itimer.o
  TIMEC   kernel/timeconst.h
Can't use 'defined(@array)' (Maybe you should just omit the defined()?) at kernel/timeconst.pl line 373.
make[6]: *** [kernel/timeconst.h] Error 255
make[5]: *** [kernel] Error 2
make[5]: Leaving directory `/home/fabius8/github/CGW/1.8.xx/build_dir/linux-ar71xx_generic/linux-3.3.8'
make[4]: *** [/home/fabius8/github/CGW/1.8.xx/build_dir/linux-ar71xx_generic/linux-3.3.8/.image] Error 2
make[4]: Leaving directory `/home/fabius8/github/CGW/1.8.xx/target/linux/ar71xx'
make[3]: *** [install] Error 2

perlbrew安装工具
* hlist
http://stackoverflow.com/questions/5489025/hash-table-in-linux-kernel/5503509#5503509

* macos clear dns
Use the following Terminal command to reset the DNS cache in OS X v10.10.4 or later:
sudo killall -HUP mDNSResponder

test
* AC
我的波特率 38400
* mail
密码
fang123!@#
* scanf
http://stackoverflow.com/questions/5750501/escaping-square-bracket-in-sscanf 
* ubuntu
如何安装deb
http://superuser.com/questions/196864/how-to-install-local-deb-packages-with-apt-get  

** install ag
Installing 'The Silver Searcher' on Ubuntu

sudo apt-get install the-silver-searcher
* linux
* stock
https://github.com/waditu/tushare
http://askubuntu.com/questions/615700/install-miniconda-python-2-7
conda install pandas

** 股票历史数据
http://www.bizeway.net/read.php?317
那么中国股市的数据有没有呢？答案是肯定的，不过要按照下面的参数做些调整，下面提供全球证券交易所的资料。
上证股票是股票代码后面加上.ss，深证股票是股票代码后面加上.sz
例如：000001 = 000001.sz
深市数据链接：http://table.finance.yahoo.com/table.csv?s=000001.sz
上市数据链接：http://table.finance.yahoo.com/table.csv?s=600000.ss
上证综指代码：000001.ss，深证成指代码：399001.SZ，沪深300代码：000300.ss

下载
code=0/1 上证 深证
http://quotes.money.163.com/service/chddata.html?code=1600770&start=20150104&end=20160108
http://quotes.money.163.com/service/chddata.html?code=0600770&start=20150104&end=20160108

http://xueqiu.com/S/SH600770/historical.csv
* 绿联网卡转换
http://www.asix.com.tw/download.php?sub=driverdetail&PItemID=136
* nginx
** enable directory listing
http://nginxlibrary.com/enable-directory-listing/
autoindex on
* docker
docker run -it ubuntu:16.04
docker commit 8c542ed36cd6 ubuntu:16.04

nightly
http://www.afzaalace.com/synergy-stable-builds/
