help/help.html
<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> openwrt</h2>
<div class="outline-text-2" id="text-48">
<p>
wireless router<br  />
</p>
</div>
<div id="outline-container-sec-48-1" class="outline-3">
<h3 id="sec-48-1"><span class="section-number-3">48.1</span> coredump enable</h3>
<div class="outline-text-3" id="text-48-1">
<p>
on your target you should extra do the following:<br  />
touch /.init_enable_core<br  />
sysctl -w "kernel.core_pattern=/tmp/%e.%p.%s.%t.core"<br  />
</p>

<p>
the first will enable core dumps on all applications started with busybox init (so the feature you enabled)<br  />
</p>

<p>
the second will tell the kernel where to store the core dumps (e.g. in <i>tmp</i>)<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> aws</h2>
<div class="outline-text-2" id="text-49">
<p>
fabius8@126.com<br  />
fang3688<br  />
雅洁建行<br  />
</p>
</div>
</div>
<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> zsh</h2>
<div class="outline-text-2" id="text-50">
<p>
修改登录shell<br  />
sudo chsh fabius8<br  />
git tab很慢:<br  />
<a href="http://stackoverflow.com/questions/9810327/git-tab-autocompletion-is-useless-can-i-turn-it-off-or-optimize-it">http://stackoverflow.com/questions/9810327/git-tab-autocompletion-is-useless-can-i-turn-it-off-or-optimize-it</a><br  />
</p>
</div>
</div>

<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> localtime</h2>
<div class="outline-text-2" id="text-51">
<p>
[root@www ~]# date<br  />
Thu Jul 28 15:08:39 CST 2011  &lt;==重點是 CST 這個時區喔！<br  />
</p>

<p>
[root@www ~]# vim /etc/sysconfig/clock<br  />
ZONE="America/New_York"       &lt;==改的是這裡啦！<br  />
</p>

<p>
[root@www ~]# cp /usr/share/zoneinfo/America/New_York /etc/localtime<br  />
[root@www ~]# date<br  />
Thu Jul 28 03:09:21 EDT 2011  &lt;==時區與時間都改變了！<br  />
</p>
</div>
</div>

<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> perl</h2>
<div class="outline-text-2" id="text-52">
<p>
  CC      kernel/itimer.o<br  />
  TIMEC   kernel/timeconst.h<br  />
Can't use 'defined(@array)' (Maybe you should just omit the defined()?) at kernel/timeconst.pl line 373.<br  />
make<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>: <b>*</b> [kernel/timeconst.h] Error 255<br  />
make<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>: <b>*</b> [kernel] Error 2<br  />
make<sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>: Leaving directory `/home/fabius8/github/CGW/1.8.xx/build_dir/linux-ar71xx_generic/linux-3.3.8'<br  />
make<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>: <b>*</b> [/home/fabius8/github/CGW/1.8.xx/build_dir/linux-ar71xx_generic/linux-3.3.8/.image] Error 2<br  />
make<sup><a id="fnr.3.100" name="fnr.3.100" class="footref" href="#fn.3">3</a></sup>: Leaving directory `/home/fabius8/github/CGW/1.8.xx/target/linux/ar71xx'<br  />
make<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>: <b>*</b> [install] Error 2<br  />
</p>

<p>
perlbrew安装工具<br  />
</p>
</div>
</div>
<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> hlist</h2>
<div class="outline-text-2" id="text-53">
<p>
<a href="http://stackoverflow.com/questions/5489025/hash-table-in-linux-kernel/5503509#5503509">http://stackoverflow.com/questions/5489025/hash-table-in-linux-kernel/5503509#5503509</a><br  />
</p>
</div>
</div>

<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> macos clear dns</h2>
<div class="outline-text-2" id="text-54">
<p>
Use the following Terminal command to reset the DNS cache in OS X v10.10.4 or later:<br  />
sudo killall -HUP mDNSResponder<br  />
</p>

<p>
test<br  />
</p>
</div>
</div>
<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> AC</h2>
<div class="outline-text-2" id="text-55">
<p>
我的波特率 38400<br  />
</p>
</div>
</div>
<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> mail</h2>
<div class="outline-text-2" id="text-56">
<p>
密码<br  />
fang123!@#<br  />
</p>
</div>
</div>
<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> scanf</h2>
<div class="outline-text-2" id="text-57">
<p>
<a href="http://stackoverflow.com/questions/5750501/escaping-square-bracket-in-sscanf">http://stackoverflow.com/questions/5750501/escaping-square-bracket-in-sscanf</a> <br  />
</p>
</div>
</div>
<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> ubuntu</h2>
<div class="outline-text-2" id="text-58">
<p>
如何安装deb<br  />
<a href="http://superuser.com/questions/196864/how-to-install-local-deb-packages-with-apt-get">http://superuser.com/questions/196864/how-to-install-local-deb-packages-with-apt-get</a>  <br  />
</p>
</div>

<div id="outline-container-sec-58-1" class="outline-3">
<h3 id="sec-58-1"><span class="section-number-3">58.1</span> install ag</h3>
<div class="outline-text-3" id="text-58-1">
<p>
Installing 'The Silver Searcher' on Ubuntu<br  />
</p>

<p>
sudo apt-get install the-silver-searcher<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> linux</h2>
</div>
<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> stock</h2>
<div class="outline-text-2" id="text-60">
<p>
<a href="https://github.com/waditu/tushare">https://github.com/waditu/tushare</a><br  />
<a href="http://askubuntu.com/questions/615700/install-miniconda-python-2-7">http://askubuntu.com/questions/615700/install-miniconda-python-2-7</a><br  />
conda install pandas<br  />
</p>
</div>

<div id="outline-container-sec-60-1" class="outline-3">
<h3 id="sec-60-1"><span class="section-number-3">60.1</span> 股票历史数据</h3>
<div class="outline-text-3" id="text-60-1">
<p>
<a href="http://www.bizeway.net/read.php?317">http://www.bizeway.net/read.php?317</a><br  />
那么中国股市的数据有没有呢？答案是肯定的，不过要按照下面的参数做些调整，下面提供全球证券交易所的资料。<br  />
上证股票是股票代码后面加上.ss，深证股票是股票代码后面加上.sz<br  />
例如：000001 = 000001.sz<br  />
深市数据链接：<a href="http://table.finance.yahoo.com/table.csv?s=000001.sz">http://table.finance.yahoo.com/table.csv?s=000001.sz</a><br  />
上市数据链接：<a href="http://table.finance.yahoo.com/table.csv?s=600000.ss">http://table.finance.yahoo.com/table.csv?s=600000.ss</a><br  />
上证综指代码：000001.ss，深证成指代码：399001.SZ，沪深300代码：000300.ss<br  />
</p>

<p>
下载<br  />
code=0/1 上证 深证<br  />
<a href="http://quotes.money.163.com/service/chddata.html?code=1600770&start=20150104&end=20160108">http://quotes.money.163.com/service/chddata.html?code=1600770&start=20150104&end=20160108</a><br  />
<a href="http://quotes.money.163.com/service/chddata.html?code=0600770&start=20150104&end=20160108">http://quotes.money.163.com/service/chddata.html?code=0600770&start=20150104&end=20160108</a><br  />
</p>

<p>
<a href="http://xueqiu.com/S/SH600770/historical.csv">http://xueqiu.com/S/SH600770/historical.csv</a><br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> 绿联网卡转换</h2>
<div class="outline-text-2" id="text-61">
<p>
<a href="http://www.asix.com.tw/download.php?sub=driverdetail&PItemID=136">http://www.asix.com.tw/download.php?sub=driverdetail&PItemID=136</a><br  />
</p>
</div>
</div>
<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> nginx</h2>
<div class="outline-text-2" id="text-62">
</div><div id="outline-container-sec-62-1" class="outline-3">
<h3 id="sec-62-1"><span class="section-number-3">62.1</span> enable directory listing</h3>
<div class="outline-text-3" id="text-62-1">
<p>
<a href="http://nginxlibrary.com/enable-directory-listing/">http://nginxlibrary.com/enable-directory-listing/</a><br  />
autoindex on<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> docker</h2>
<div class="outline-text-2" id="text-63">
<p>
docker run -it ubuntu:16.04<br  />
docker commit 8c542ed36cd6 ubuntu:16.04<br  />
</p>

<p>
nightly<br  />
<a href="http://www.afzaalace.com/synergy-stable-builds/">http://www.afzaalace.com/synergy-stable-builds/</a><br  />
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2017-04-20 Thu 16:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
